#include <iostream>
#include <cmath>
#include <windows.h>
using namespace std;
int main()
{
    SetConsoleCP(1251);
    SetConsoleOutputCP(1251);
    double A[3][4] = { { 5.0, 2.0, 0.0, 10.0 },
                      { 3.0, 5.0, 2.0, 5.0 },
                      { 20.0, 0.0, 0.0, 0.0 } };

    double B[4][2] = { {1.20, 0.5},
                       {2.8, 0.4},
                       {5.0, 1.0},
                       {2.0,1.5} };
    double C[3][2] = { 0 };

    for (int h1 = 0; h1 <= 2; h1++) {
        for (int l1 = 0; l1 <= 1; l1++) {
            for (int k = 0; k <= 3; k++) {
                C[h1][l1] += (A[h1][k] * B[k][l1]);
            }
        }
    }

    cout << endl << "   \x1b[4mТаблица C                           \x1b[0m" << endl
        << "  |\x1b[4mПродавец|   Выручка   Комиссионные  \x1b[0m| " << endl;

    for (int h1 = 0; h1 <= 2; h1++) {
        cout << "  |    " << h1 + 1 << "   |    "; // Номер продавеца
        for (int l1 = 0; l1 <= 1; l1++) {
            //Пробелы
            if ((h1 == 2 and l1 == 0) or (h1 == 1 and l1 == 1)) {
                cout << " ";
            }
            if (h1 == 2 and l1 == 1) {
                cout << "  ";
            }

            cout << C[h1][l1]; //Вывод значений таблицы

            //Пробелы
            if (l1 == 0) {
                cout << "         ";
            }
            else {
                cout << "      ";
            }
        }
        //Пробелы
        if (h1 > 0) {
            cout << " |" << endl << "  |\x1b[4m        |                           \x1b[0m|" << endl;
        }
        else {
            cout << "|" << endl << "  |\x1b[4m        |                           \x1b[0m|" << endl;
        }
    }

    cout << endl << "  1) Продавец, который выручил больше всего денег с продажи: 2" << endl;
    cout << "     Продавец, который выручил меньше всего денег с продажи: 3" << endl << endl;

    cout << "  2) Продавец, который получил наибольшие комиссионные: 1" << endl;
    cout << "     Продавец, который получил наименьшие комиссионные: 3" << endl << endl;

    cout << "  3) Общая сумма денег, вырученных за проданные товары: " << C[0][0] + C[1][0] + C[2][0] << endl;
    cout << "  4) Всего комиссионных получили продавцы: " << C[0][1] + C[1][1] + C[2][1] << endl;
    cout << "  5) Общая сумма денег, прошедших через руки продавцов: " << C[0][0] + C[1][0] + C[2][0] + C[0][1] + C[1][1] + C[2][1] << endl << endl << endl;

    return 0;
}
